STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval.c
/**
  ******************************************************************************
  * @file    stm32l476g_eval.c
  * @author  MCD Application Team
  * @brief   This file provides a set of firmware functions to manage Leds, 
  *          push-button and COM ports for STM32L476G_EVAL
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
  
/* Includes ------------------------------------------------------------------*/
#include "stm32l476g_eval.h"
#if defined(USE_IOEXPANDER)
#include "stm32l476g_eval_io.h"
#endif /* USE_IOEXPANDER */

/** @addtogroup BSP
  * @{
  */ 

/** @defgroup STM32L476G_EVAL STM32L476G_EVAL
  * @{
  */ 

/** @defgroup STM32L476G_EVAL_Common STM32L476G_EVAL Common
  * @{
  */   
    
/** @defgroup STM32L476G_EVAL_Private_TypesDefinitions Private Types Definitions
  * @brief This file provides firmware functions to manage Leds, push-buttons, 
  *        COM ports, SD card on SPI and temperature sensor (TS751) available on 
  *        STM32L476G-EVAL evaluation board from STMicroelectronics.
  * @{
  */

typedef struct
{
  __IO uint16_t LCD_REG_R; /* Read Register */
  __IO uint16_t LCD_RAM_R; /* Read RAM */
  __IO uint16_t LCD_REG_W; /* Write Register */
  __IO uint16_t LCD_RAM_W; /* Write RAM */
} TFT_LCD_TypeDef;

/**
  * @}
  */

/** @defgroup STM32L476G_EVAL_Private_Defines Private Defines
  * @{
  */ 
/* LINK LCD */
#define START_BYTE         0x70
#define SET_INDEX          0x00
#define READ_STATUS        0x01
#define LCD_WRITE_REG      0x02
#define LCD_READ_REG       0x03

/**
 * @brief STM32L476G EVAL BSP Driver version number
   */
#define __STM32L476G_EVAL_BSP_VERSION_MAIN   (0x02) /*!< [31:24] main version */
#define __STM32L476G_EVAL_BSP_VERSION_SUB1   (0x01) /*!< [23:16] sub1 version */
#define __STM32L476G_EVAL_BSP_VERSION_SUB2   (0x04) /*!< [15:8]  sub2 version */
#define __STM32L476G_EVAL_BSP_VERSION_RC     (0x00) /*!< [7:0]  release candidate */
#define __STM32L476G_EVAL_BSP_VERSION            ((__STM32L476G_EVAL_BSP_VERSION_MAIN << 24)\
                                                 |(__STM32L476G_EVAL_BSP_VERSION_SUB1 << 16)\
                                                 |(__STM32L476G_EVAL_BSP_VERSION_SUB2 << 8 )\
                                                 |(__STM32L476G_EVAL_BSP_VERSION_RC))

/* Note: LCD /CS is NE3 - Bank 3 of NOR/SRAM Bank 1~4 */
#define TFT_LCD_BASE  FMC_BANK1_3
#define TFT_LCD       ((TFT_LCD_TypeDef *) TFT_LCD_BASE)

/**
  * @}
  */


/** @defgroup STM32L476G_EVAL_Exported_Variables Exported Variables
  * @{
  */

/**
 * @brief LED variables
 */                                 
#if defined(USE_STM32L476G_EVAL_REVA)
 /* 0xFFFF to mark as invalid port (LED2, LED3 and LED4 accessed thru IOExpander) */
GPIO_TypeDef*   LED_PORT[LEDn] =                {LED1_GPIO_PORT,
                                                 (GPIO_TypeDef *)0xFFFF,
                                                 (GPIO_TypeDef *)0xFFFF,
                                                 (GPIO_TypeDef *)0xFFFF};
#elif defined(USE_STM32L476G_EVAL_REVB)
 /* 0xFFFF to mark as invalid port (LED2 and LED4 accessed thru IOExpander) */
GPIO_TypeDef*   LED_PORT[LEDn] =                {LED1_GPIO_PORT,
                                                 (GPIO_TypeDef *)0xFFFF,
                                                 LED3_GPIO_PORT,
                                                 (GPIO_TypeDef *)0xFFFF};
#endif

#if defined(USE_IOEXPANDER)
const uint16_t  LED_PIN[LEDn] =                 {LED1_PIN,
                                                 LED2_PIN,
                                                 LED3_PIN,
                                                 LED4_PIN};
#else
#if defined(USE_STM32L476G_EVAL_REVA)
const uint16_t  LED_PIN[LEDn] =                 {LED1_PIN,
                                                 (uint16_t)0x0,
                                                 (uint16_t)0x0,
                                                 (uint16_t)0x0};
#elif defined(USE_STM32L476G_EVAL_REVB)
const uint16_t  LED_PIN[LEDn] =                 {LED1_PIN,
                                                 (uint16_t)0x0,
                                                 LED3_PIN,
                                                 (uint16_t)0x0};
#endif
#endif /* USE_IOEXPANDER */

/**
 * @brief BUTTON variables
 */
#if defined(USE_IOEXPANDER)
GPIO_TypeDef*   BUTTON_PORT[BUTTONn] =          {TAMPER_BUTTON_GPIO_PORT,
                                                 (GPIO_TypeDef *)0xFFFF,
                                                 (GPIO_TypeDef *)0xFFFF,
                                                 (GPIO_TypeDef *)0xFFFF,
                                                 (GPIO_TypeDef *)0xFFFF,
                                                 (GPIO_TypeDef *)0xFFFF}; 
/* 0xFFFF to mark as invalid port (Joystick buttons accessed thru IOExpander) */                                                 
#else
GPIO_TypeDef*   BUTTON_PORT[BUTTONn] =          {TAMPER_BUTTON_GPIO_PORT}; 
#endif /* USE_IOEXPANDER */

#if defined(USE_IOEXPANDER)
const uint16_t  BUTTON_PIN[BUTTONn] =           {TAMPER_BUTTON_PIN,
                                                 SEL_JOY_PIN, 
                                                 LEFT_JOY_PIN, 
                                                 RIGHT_JOY_PIN, 
                                                 DOWN_JOY_PIN, 
                                                 UP_JOY_PIN}; 
                                
const uint8_t   BUTTON_IRQn[BUTTONn] =          {TAMPER_BUTTON_EXTI_IRQn,
                                                 SEL_JOY_EXTI_IRQn,
                                                 LEFT_JOY_EXTI_IRQn,
                                                 RIGHT_JOY_EXTI_IRQn,
                                                 DOWN_JOY_EXTI_IRQn,
                                                 UP_JOY_EXTI_IRQn};
#else
const uint16_t  BUTTON_PIN[BUTTONn] =           {TAMPER_BUTTON_PIN}; 
                                
const uint8_t   BUTTON_IRQn[BUTTONn] =          {TAMPER_BUTTON_EXTI_IRQn};
#endif /* USE_IOEXPANDER */

#if defined(USE_IOEXPANDER)
/**
 * @brief JOYSTICK variables
 */

const uint16_t JOY_PIN[JOYn] = {SEL_JOY_PIN, 
                                LEFT_JOY_PIN, 
                                RIGHT_JOY_PIN, 
                                DOWN_JOY_PIN, 
                                UP_JOY_PIN}; 

const uint8_t JOY_IRQn[JOYn] = {SEL_JOY_EXTI_IRQn,  
                                LEFT_JOY_EXTI_IRQn, 
                                RIGHT_JOY_EXTI_IRQn,
                                DOWN_JOY_EXTI_IRQn, 
                                UP_JOY_EXTI_IRQn};  
#endif /* USE_IOEXPANDER */

/**
 * @brief COM variables
 */
USART_TypeDef*  COM_USART[COMn]   =             {EVAL_COM1}; 

GPIO_TypeDef*   COM_TX_PORT[COMn] =             {EVAL_COM1_TX_GPIO_PORT};
 
GPIO_TypeDef*   COM_RX_PORT[COMn] =             {EVAL_COM1_RX_GPIO_PORT};

const uint16_t  COM_TX_PIN[COMn]  =             {EVAL_COM1_TX_PIN};

const uint16_t  COM_RX_PIN[COMn]  =             {EVAL_COM1_RX_PIN};
 
const uint16_t COM_TX_AF[COMn]    =             {EVAL_COM1_TX_AF};

const uint16_t COM_RX_AF[COMn]    =             {EVAL_COM1_RX_AF};

/**
 * @brief BUS variables
 */

#ifdef HAL_I2C_MODULE_ENABLED
uint32_t heval_I2cxTimeout = EVAL_I2Cx_TIMEOUT_MAX;   /*<! Value of Timeout when I2C communication fails */
I2C_HandleTypeDef heval_I2c;
#endif /* HAL_I2C_MODULE_ENABLED */

/**
  * @}
  */ 

