STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L476G_EVAL/stm32l476g_eval.c
/** @defgroup STM32L476G_EVAL_Private_FunctionPrototypes Private Functions
  * @{
  */ 
/* FMC bus function */
#ifdef HAL_SRAM_MODULE_ENABLED
static void               FMC_BANK3_WriteData(uint16_t Data);
static void               FMC_BANK3_WriteReg(uint8_t Reg);
static uint16_t           FMC_BANK3_ReadData(uint8_t Reg);
static void               FMC_BANK3_Init(void);
static void               FMC_BANK3_MspInit(void);

/* LCD IO functions */
void                      LCD_IO_Init(void);
void                      LCD_IO_WriteMultipleData(uint8_t *pData, uint32_t Size);
void                      LCD_IO_WriteReg(uint8_t Reg);
uint16_t                  LCD_IO_ReadData(uint8_t Reg);
void                      LCD_Delay (uint32_t delay);
#endif /* HAL_SRAM_MODULE_ENABLED */

/* I2Cx bus function */
#ifdef HAL_I2C_MODULE_ENABLED
/* Link function I2C for EEPROM, Audio Codec peripheral and IO expanders*/
static void               I2Cx_Init(void);
static void               I2Cx_MspInit(I2C_HandleTypeDef *hi2c);  
static void               I2Cx_DeInit(void);
static void               I2Cx_MspDeInit(I2C_HandleTypeDef *hi2c);  
static HAL_StatusTypeDef  I2Cx_WriteBuffer(uint16_t Addr, uint16_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length);
static HAL_StatusTypeDef  I2Cx_ReadBuffer(uint16_t Addr, uint16_t Reg, uint16_t RegSize, uint8_t *pBuffer, uint16_t Length);
static HAL_StatusTypeDef  I2Cx_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);
static void               I2Cx_Error (void);

#if defined(USE_IOEXPANDER)
/* Link function I2C for IO expanders */
static void               I2Cx_WriteData(uint16_t Addr, uint16_t Reg, uint16_t RegSize, uint8_t Value);
static uint8_t            I2Cx_ReadData(uint16_t Addr, uint16_t Reg, uint16_t RegSize);

/* IOExpander IO functions */
void                      IOE_Init(void);
void                      IOE_ITConfig(void);
void                      IOE_Delay(uint32_t Delay);
void                      IOE_Write(uint8_t Addr, uint8_t Reg, uint8_t Value);
uint8_t                   IOE_Read(uint8_t Addr, uint8_t Reg);
uint16_t                  IOE_ReadMultiple(uint8_t Addr, uint8_t Reg, uint8_t *Buffer, uint16_t Length);
#endif /* USE_IOEXPANDER */

/* Link function for EEPROM peripheral over I2C */
void                      EEPROM_I2C_IO_Init(void);
HAL_StatusTypeDef         EEPROM_I2C_IO_WriteData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize);
HAL_StatusTypeDef         EEPROM_I2C_IO_ReadData(uint16_t DevAddress, uint16_t MemAddress, uint8_t* pBuffer, uint32_t BufferSize);
HAL_StatusTypeDef         EEPROM_I2C_IO_IsDeviceReady(uint16_t DevAddress, uint32_t Trials);

/* Link function for Audio Codec peripheral */
void                      AUDIO_IO_Init(void);
void                      AUDIO_IO_DeInit(void);
void                      AUDIO_IO_Write(uint8_t Addr, uint16_t Reg, uint16_t Value);
uint16_t                  AUDIO_IO_Read(uint8_t Addr, uint16_t Reg);
void                      AUDIO_IO_Delay(uint32_t delay);
#endif/* HAL_I2C_MODULE_ENABLED */

/**
  * @}
  */ 

/** @defgroup STM32L476G_EVAL_Exported_Functions Exported Functions
  * @{
  */ 

/**
  * @brief  This method returns the STM32L476G EVAL BSP Driver revision
  * @retval version : 0xXYZR (8bits for each decimal, R for RC)
  */
uint32_t BSP_GetVersion(void)
{
  return __STM32L476G_EVAL_BSP_VERSION;
}

/**
  * @brief  Configures LED GPIO.
  * @param  Led: Specifies the Led to be configured. 
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void BSP_LED_Init(Led_TypeDef Led)
{
  GPIO_InitTypeDef  gpioinitstruct = {0};
  
#if defined(USE_STM32L476G_EVAL_REVA)
  if (Led == LED1)
#elif defined(USE_STM32L476G_EVAL_REVB)
  if ((Led == LED1) || (Led == LED3))
#endif
  {
    /* Enable the GPIO_LED clock */
    LEDx_GPIO_CLK_ENABLE(Led);

    /* Configure the GPIO_LED pin */
    gpioinitstruct.Pin    = LED_PIN[Led];
    gpioinitstruct.Mode   = GPIO_MODE_OUTPUT_PP;
    gpioinitstruct.Pull   = GPIO_PULLUP;
    gpioinitstruct.Speed  = GPIO_SPEED_FREQ_VERY_HIGH;

    HAL_GPIO_Init(LED_PORT[Led], &gpioinitstruct);

    /* By default, turn off LED */
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
  }
#if defined(USE_IOEXPANDER)
  else
  {
    /* Initialize the IO functionalities */
    BSP_IO_Init();
    
    BSP_IO_ConfigPin(LED_PIN[Led],IO_MODE_OUTPUT);
    
    /* By default, turn off LED */
    BSP_IO_WritePin(LED_PIN[Led], GPIO_PIN_SET);
  }
#endif /* USE_IOEXPANDER */     
}

/**
  * @brief  Turns selected LED On.
  * @param  Led: Specifies the Led to be set on. 
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void BSP_LED_On(Led_TypeDef Led)
{
#if defined(USE_STM32L476G_EVAL_REVA)
  if (Led == LED1)
#elif defined(USE_STM32L476G_EVAL_REVB)
  if ((Led == LED1) || (Led == LED3))
#endif
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_RESET);
  }
#if defined(USE_IOEXPANDER)
  else
  {
    BSP_IO_WritePin(LED_PIN[Led], GPIO_PIN_RESET);
  }
#endif /* USE_IOEXPANDER */
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led: Specifies the Led to be set off. 
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void BSP_LED_Off(Led_TypeDef Led)
{
#if defined(USE_STM32L476G_EVAL_REVA)
  if (Led == LED1)
#elif defined(USE_STM32L476G_EVAL_REVB)
  if ((Led == LED1) || (Led == LED3))
#endif
  {
    HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_PIN_SET);
  }
#if defined(USE_IOEXPANDER)
  else
  {
    BSP_IO_WritePin(LED_PIN[Led], GPIO_PIN_SET);
  }
#endif /* USE_IOEXPANDER */
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led: Specifies the Led to be toggled. 
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void BSP_LED_Toggle(Led_TypeDef Led)
{
#if defined(USE_STM32L476G_EVAL_REVA)
  if (Led == LED1)
#elif defined(USE_STM32L476G_EVAL_REVB)
  if ((Led == LED1) || (Led == LED3))
#endif
  {
    HAL_GPIO_TogglePin(LED_PORT[Led], LED_PIN[Led]);
  }
#if defined(USE_IOEXPANDER)
  else
  {
    BSP_IO_TogglePin(LED_PIN[Led]);
  }
#endif /* USE_IOEXPANDER */
}

/**
  * @brief  Configures push button GPIO and EXTI Line.
  * @param  Button: Button to be configured.
  *   This parameter can be one of the following values: 
  *     @arg BUTTON_TAMPER: Wakeup/Tamper Push Button 
  * @param  Button_Mode: Button mode requested.
  *   This parameter can be one of the following values:   
  *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO 
  *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                            with interrupt generation capability
  * @retval None
  */
void BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef Button_Mode)
{
  GPIO_InitTypeDef gpioinitstruct = {0};

